Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM330.svd
<?xml version="1.0" encoding="UTF-8"?>
<device xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.1" xsi:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
  <name>SWM330</name>
  <version>1.0</version>
  <description>SWM330 Microcontroller registers</description>
  <cpu>
    <name>CM0</name>
    <endian>little</endian>
    <revision>r1p0</revision>
    <nvicPrioBits>2</nvicPrioBits>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <access>read-write</access>
  <resetValue>0</resetValue>
  <resetMask>0</resetMask>
  <peripherals>
    <peripheral>
      <name>SYS</name>
      <description>Registers group</description>
      <groupName>SYS</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x0A5840</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CLKSEL</name>
          <description>CLKSEL register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SYS</name>
              <description>SYS field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK_DIVx</name>
              <description>CLK_DIVx field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK</name>
              <description>CLK field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEP</name>
              <description>SLEEP field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIVx_ON</name>
          <description>CLKDIVx_ON register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CLKEN0</name>
          <description>CLKEN0 register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GPIOA</name>
              <description>GPIOA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOB</name>
              <description>GPIOB field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOC</name>
              <description>GPIOC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOD</name>
              <description>GPIOD field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI0</name>
              <description>SPI0 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2S0</name>
              <description>I2S0 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAC0</name>
              <description>DAC0 field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC0 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMR</name>
              <description>TIMR field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTIMR</name>
              <description>BTIMR field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWM</name>
              <description>PWM field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO</name>
              <description>SDIO field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCD</name>
              <description>LCD field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC</name>
              <description>CRC field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QSPI0</name>
              <description>QSPI0 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QSPI1</name>
              <description>QSPI1 field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRA</name>
              <description>SRA field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA2D</name>
              <description>DMA2D field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JPEG</name>
              <description>JPEG field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DVP</name>
              <description>DVP field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRAM</name>
              <description>PSRAM field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDMA</name>
              <description>RDMA field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKEN1</name>
          <description>CLKEN1 register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDT</name>
              <description>WDT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART0</name>
              <description>UART0 field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1</name>
              <description>UART1 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2</name>
              <description>UART2 field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART3</name>
              <description>UART3 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UART4</name>
              <description>UART4 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C0</name>
              <description>I2C0 field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C1</name>
              <description>I2C1 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAN0</name>
              <description>CAN0 field</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANAC</name>
              <description>ANAC field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIOE</name>
              <description>GPIOE field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MODE</name>
          <description>MODE register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WKEDGE</name>
              <description>WKEDGE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTSR</name>
          <description>RSTSR register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>POR</name>
              <description>POR field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOD</name>
              <description>BOD field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCWKCR</name>
          <description>RTCWKCR register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WREN</name>
              <description>WREN field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCWKSR</name>
          <description>RTCWKSR register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLAG</name>
              <description>FLAG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PSDLYADJ</name>
          <description>PSDLYADJ register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DQS100</name>
              <description>DQS100 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DQS400</name>
              <description>DQS400 field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK100</name>
              <description>CLK100 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK400</name>
              <description>CLK400 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID[%s]</name>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <description>CHIPID register</description>
          <addressOffset>0x000080</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>BACKUP[%s]</name>
          <dim>6</dim>
          <dimIncrement>4</dimIncrement>
          <description>BACKUP register</description>
          <addressOffset>0x000090</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PAWKEN</name>
          <description>PAWKEN register</description>
          <addressOffset>0x000100</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PBWKEN</name>
          <description>PBWKEN register</description>
          <addressOffset>0x000104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PCWKEN</name>
          <description>PCWKEN register</description>
          <addressOffset>0x000108</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PDWKEN</name>
          <description>PDWKEN register</description>
          <addressOffset>0x00010C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PEWKEN</name>
          <description>PEWKEN register</description>
          <addressOffset>0x000110</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PAWKSR</name>
          <description>PAWKSR register</description>
          <addressOffset>0x000130</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PBWKSR</name>
          <description>PBWKSR register</description>
          <addressOffset>0x000134</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PCWKSR</name>
          <description>PCWKSR register</description>
          <addressOffset>0x000138</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PDWKSR</name>
          <description>PDWKSR register</description>
          <addressOffset>0x00013C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PEWKSR</name>
          <description>PEWKSR register</description>
          <addressOffset>0x000140</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>PRSTEN</name>
          <description>PRSTEN register</description>
          <addressOffset>0x000720</addressOffset>
          <access>read-write</access>
        </register>
