Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM330.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD</name>
      <description>Registers group</description>
      <groupName>LCD</groupName>
      <baseAddress>0x40001800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00010C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PART</name>
              <description>PART field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PART</name>
              <description>PART field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCR</name>
          <description>OUTCR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BYTE0</name>
              <description>BYTE0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE0INV</name>
              <description>BYTE0INV field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE1</name>
              <description>BYTE1 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE1INV</name>
              <description>BYTE1INV field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE2</name>
              <description>BYTE2 field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE2INV</name>
              <description>BYTE2INV field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>START</name>
          <description>START register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>GO</name>
              <description>GO field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED</name>
          <description>RESERVED register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLKDIV</name>
              <description>CLKDIV field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKINV</name>
              <description>CLKINV field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKALW</name>
              <description>CLKALW field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BURSTLEN</name>
              <description>BURSTLEN field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PARTSIZE</name>
              <description>PARTSIZE field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTORESTA</name>
              <description>AUTORESTA field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMMRELOAD</name>
              <description>IMMRELOAD field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBPRELOAD</name>
              <description>VBPRELOAD field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>FORMAT field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>MODE field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNCINV</name>
              <description>VSYNCINV field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSYNCINV</name>
              <description>HSYNCINV field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VS2HS</name>
              <description>VS2HS field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPU8MSB</name>
              <description>MPU8MSB field</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUDMAMSB</name>
              <description>MPUDMAMSB field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPU8PIN</name>
              <description>MPU8PIN field</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRH0</name>
          <description>CRH0 register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HSW</name>
              <description>HSW field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HBP</name>
              <description>HBP field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFP</name>
              <description>HFP field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRH1</name>
          <description>CRH1 register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIX</name>
              <description>PIX field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRV0</name>
          <description>CRV0 register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>VSW</name>
              <description>VSW field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBP</name>
              <description>VBP field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VFP</name>
              <description>VFP field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRV1</name>
          <description>CRV1 register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PIX</name>
              <description>PIX field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BGC</name>
          <description>BGC register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
        </register>
        <cluster>
          <name>L0</name>
          <description>register cluster</description>
          <addressOffset>0x000040</addressOffset>
          <register>
            <name>LCR</name>
            <description>LCR register</description>
            <addressOffset>0x000000</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>ALPHA</name>
                <description>ALPHA field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EN</name>
                <description>EN field</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>CKEN</name>
                <description>CKEN field</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WHP</name>
            <description>WHP register</description>
            <addressOffset>0x000004</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>STA</name>
                <description>STA field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STP</name>
                <description>STP field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WVP</name>
            <description>WVP register</description>
            <addressOffset>0x000008</addressOffset>
            <access>read-write</access>
            <fields>
              <field>
                <name>STA</name>
                <description>STA field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>STP</name>
                <description>STP field</description>
                <bitOffset>16</bitOffset>
                <bitWidth>13</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDR</name>
            <description>ADDR register</description>
            <addressOffset>0x00000C</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>LLEN</name>
            <description>LLEN register</description>
            <addressOffset>0x000010</addressOffset>
            <access>read-write</access>
          </register>
          <register>
            <name>CK</name>
            <description>CK register</description>
            <addressOffset>0x000014</addressOffset>
            <access>read-write</access>
          </register>
        </cluster>
        <register>
          <name>MPUCR</name>
          <description>MPUCR register</description>
          <addressOffset>0x000100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>RCS1_0</name>
              <description>RCS1_0 field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RDHOLD</name>
              <description>RDHOLD field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WCS1_0</name>
              <description>WCS1_0 field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR1CS1</name>
              <description>WR1CS1 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRHOLD</name>
              <description>WRHOLD field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS0WR0</name>
              <description>CS0WR0 field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED5</name>
          <description>RESERVED5 register</description>
          <addressOffset>0x000104</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RESERVED6</name>
          <description>RESERVED6 register</description>
          <addressOffset>0x000108</addressOffset>
          <access>read-write</access>
        </register>
