Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM330.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SRA</name>
      <description>Registers group</description>
      <groupName>SRA</groupName>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000048</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>START</name>
              <description>START field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ABORT</name>
              <description>ABORT field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>SR register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>BUSY field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ABORT</name>
              <description>ABORT field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDIS</name>
          <description>IDIS register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRAME</name>
              <description>FRAME field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_8LINE</name>
              <description>_8LINE field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTERR</name>
              <description>ROTERR field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>BUSERR field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFE</name>
          <alternateRegister>IDIS</alternateRegister>
          <description>IFE register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRAME</name>
              <description>FRAME field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_8LINE</name>
              <description>_8LINE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTERR</name>
              <description>ROTERR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>BUSERR field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRAME</name>
              <description>FRAME field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>_8LINE</name>
              <description>_8LINE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTERR</name>
              <description>ROTERR field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>BUSERR field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>CFG register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCFMT</name>
              <description>SRCFMT field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCRBSWAP</name>
              <description>SRCRBSWAP field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCXSWAP</name>
              <description>SRCXSWAP field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTFMT</name>
              <description>DSTFMT field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTRBSWAP</name>
              <description>DSTRBSWAP field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTXSWAP</name>
              <description>DSTXSWAP field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTTYP</name>
              <description>ROTTYP field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROTAAEN</name>
              <description>ROTAAEN field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALPHADIS</name>
              <description>ALPHADIS field</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLENDBG</name>
              <description>BLENDBG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUMMYWB</name>
              <description>DUMMYWB field</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINP</name>
          <description>SINP register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SINX</name>
              <description>SINX field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINY</name>
              <description>SINY field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COSP</name>
          <description>COSP register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>COSX</name>
              <description>COSX field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COSY</name>
              <description>COSY field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRC_TILE_POSX</name>
          <description>SRC_TILE_POSX register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SRC_TILE_POSY</name>
          <description>SRC_TILE_POSY register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DST_TILE_OFFX</name>
          <description>DST_TILE_OFFX register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DST_TILE_OFFY</name>
          <description>DST_TILE_OFFY register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>BGCOLOR</name>
          <description>BGCOLOR register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SRCBASE</name>
          <description>SRCBASE register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>SRCSIZE</name>
          <description>SRCSIZE register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>WIDTH field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEIGHT</name>
              <description>HEIGHT field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCSTRIDE</name>
          <description>SRCSTRIDE register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DSTBASE</name>
          <description>DSTBASE register</description>
          <addressOffset>0x00003C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>DSTSIZE</name>
          <description>DSTSIZE register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>WIDTH field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HEIGHT</name>
              <description>HEIGHT field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTSTRIDE</name>
          <description>DSTSTRIDE register</description>
          <addressOffset>0x000044</addressOffset>
          <access>read-write</access>
        </register>
