Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM330.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DVP</name>
      <description>Registers group</description>
      <groupName>DVP</groupName>
      <baseAddress>0x40003900</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000058</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENA</name>
              <description>ENA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLR</name>
              <description>CLR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DROPEN</name>
              <description>DROPEN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CONTEN</name>
              <description>CONTEN field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INFMT</name>
              <description>INFMT field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSEQ</name>
              <description>INSEQ field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INSWAP</name>
              <description>INSWAP field</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELDSTM</name>
              <description>FIELDSTM field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFMT</name>
              <description>OUTFMT field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RAWBIT</name>
              <description>RAWBIT field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RBSWAP</name>
              <description>RBSWAP field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>YUVRANGE</name>
              <description>YUVRANGE field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IE</name>
          <description>IE register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME</name>
              <description>FRAME field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINES</name>
              <description>LINES field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFULL</name>
              <description>BUFULL field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSZCHG</name>
              <description>HSZCHG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSZCHG</name>
              <description>VSZCHG field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODERR</name>
              <description>CODERR field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>UPDATE field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DONE</name>
              <description>DONE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME</name>
              <description>FRAME field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LINES</name>
              <description>LINES field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUFULL</name>
              <description>BUFULL field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSZCHG</name>
              <description>HSZCHG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSZCHG</name>
              <description>VSZCHG field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CODERR</name>
              <description>CODERR field</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UPDATE</name>
              <description>UPDATE field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICFG</name>
          <description>ICFG register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>LINES</name>
              <description>LINES field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INPOL</name>
          <description>INPOL register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>PCLK</name>
              <description>PCLK field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HREF</name>
              <description>HREF field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC</name>
              <description>VSYNC field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>FIELD field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INHSZ</name>
          <description>INHSZ register</description>
          <addressOffset>0x000014</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>CODE</name>
              <description>CODE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CODERR</name>
              <description>CODERR field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIXELS</name>
              <description>PIXELS field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INVSZ</name>
          <description>INVSZ register</description>
          <addressOffset>0x000018</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>LINE</name>
              <description>LINE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>FIELD field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LINES</name>
              <description>LINES field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTHSZ</name>
          <description>OUTHSZ register</description>
          <addressOffset>0x00001C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BEGIN</name>
              <description>BEGIN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT</name>
              <description>COUNT field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTVSZ</name>
          <description>OUTVSZ register</description>
          <addressOffset>0x000020</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>BEGIN</name>
              <description>BEGIN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT</name>
              <description>COUNT field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OUTCFG</name>
          <description>OUTCFG register</description>
          <addressOffset>0x000024</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>FRAME</name>
              <description>FRAME field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIELD</name>
              <description>FIELD field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT</name>
              <description>COUNT field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VIDEO</name>
              <description>VIDEO field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CURFRM</name>
          <description>CURFRM register</description>
          <addressOffset>0x000028</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>OUTCR</name>
          <description>OUTCR register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CAPON</name>
              <description>CAPON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OFFMODE</name>
              <description>OFFMODE field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMABUSY</name>
              <description>DMABUSY field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSBUSY</name>
              <description>BUSBUSY field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSERR</name>
              <description>BUSERR field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UPDATE</name>
          <description>UPDATE register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>BASE_YRAW</name>
          <description>BASE_YRAW register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>BASE_UV</name>
          <description>BASE_UV register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>ADDR_YRAW</name>
          <description>ADDR_YRAW register</description>
          <addressOffset>0x00003C</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>ADDR_UV</name>
          <description>ADDR_UV register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>STEP_YRAW</name>
          <description>STEP_YRAW register</description>
          <addressOffset>0x000044</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>STEP_UV</name>
          <description>STEP_UV register</description>
          <addressOffset>0x000048</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>BASE_YRAW_SHA</name>
          <description>BASE_YRAW_SHA register</description>
          <addressOffset>0x00004C</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>BASE_UV_SHA</name>
          <description>BASE_UV_SHA register</description>
          <addressOffset>0x000050</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>STEP_SHA</name>
          <description>STEP_SHA register</description>
          <addressOffset>0x000054</addressOffset>
          <access>read-only</access>
        </register>
