Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM330.svd
        <register>
          <name>SHIFTR</name>
          <description>SHIFTR register</description>
          <addressOffset>0x00002C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUBSS</name>
              <description>SUBSS field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADD1S</name>
              <description>ADD1S field</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSTR</name>
          <description>TSTR register</description>
          <addressOffset>0x000030</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>SEC</name>
              <description>SEC field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEC10</name>
              <description>SEC10 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIN</name>
              <description>MIN field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIN10</name>
              <description>MIN10 field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOUR</name>
              <description>HOUR field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HOUR10</name>
              <description>HOUR10 field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PM</name>
              <description>PM field</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSDR</name>
          <description>TSDR register</description>
          <addressOffset>0x000034</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATE</name>
              <description>DATE field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATE10</name>
              <description>DATE10 field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MON</name>
              <description>MON field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MON10</name>
              <description>MON10 field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DAY</name>
              <description>DAY field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSS</name>
          <description>TSSS register</description>
          <addressOffset>0x000038</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>CALIBL</name>
          <description>CALIBL register</description>
          <addressOffset>0x00003C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CALM</name>
              <description>CALM field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC16</name>
              <description>SEC16 field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEC8</name>
              <description>SEC8 field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CALP</name>
              <description>CALP field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TAMPER</name>
          <description>TAMPER register</description>
          <addressOffset>0x000040</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENA</name>
              <description>ENA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLAR</name>
              <description>POLAR field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>IE field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEN</name>
              <description>TSEN field</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAMFREQ</name>
              <description>SAMFREQ field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER</name>
              <description>FILTER field</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRECHG</name>
              <description>PRECHG field</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUPDIS</name>
              <description>PUPDIS field</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIN</name>
              <description>PIN field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSPIN</name>
              <description>TSPIN field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPP</name>
              <description>OUTPP field</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMASS</name>
          <description>ALRMASS register</description>
          <addressOffset>0x000044</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUBSEC</name>
              <description>SUBSEC field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>MASK field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMBSS</name>
          <description>ALRMBSS register</description>
          <addressOffset>0x000048</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUBSEC</name>
              <description>SUBSEC field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK</name>
              <description>MASK field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESERVED</name>
          <description>RESERVED register</description>
          <addressOffset>0x00004C</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>BACKUP[%s]</name>
          <dim>20</dim>
          <dimIncrement>4</dimIncrement>
          <description>BACKUP register</description>
          <addressOffset>0x000050</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>RESERVED2</name>
          <description>RESERVED2 register</description>
          <addressOffset>0x0000A0</addressOffset>
          <access>read-only</access>
        </register>
        <register>
          <name>LVRCR</name>
          <description>LVRCR register</description>
          <addressOffset>0x0000A4</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENA</name>
              <description>ENA field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVL</name>
              <description>LVL field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>X32KCR</name>
          <description>X32KCR register</description>
          <addressOffset>0x0000A8</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>ON</name>
              <description>ON field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IBST</name>
              <description>IBST field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPS</name>
              <description>BYPS field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCR</name>
          <description>PWRCR register</description>
          <addressOffset>0x0000AC</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>SLEEP</name>
              <description>SLEEP field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>STOP field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEEPSLP</name>
              <description>DEEPSLP field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>CLKSRC field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO1V8</name>
              <description>LDO1V8 field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGTRIM</name>
              <description>BGTRIM field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
