Synwit-Co-Ltd/Synwit.SWM32_DFP/SVD/SWM330.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Registers group</description>
      <groupName>WDT</groupName>
      <baseAddress>0x400A0800</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x000014</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>RSTVAL</name>
          <description>RSTVAL register</description>
          <addressOffset>0x000000</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>INTVAL</name>
          <description>INTVAL register</description>
          <addressOffset>0x000004</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>CR</name>
          <description>CR register</description>
          <addressOffset>0x000008</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>EN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTEN</name>
              <description>RSTEN field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEN</name>
              <description>INTEN field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WINEN</name>
              <description>WINEN field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV</name>
              <description>CKDIV field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IF</name>
          <description>IF register</description>
          <addressOffset>0x00000C</addressOffset>
          <access>read-write</access>
        </register>
        <register>
          <name>FEED</name>
          <description>FEED register</description>
          <addressOffset>0x000010</addressOffset>
          <access>read-write</access>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>
